#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.subdomain["actual"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "actual.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["bazar"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "bazar.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["compartilhado"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "compartilhado.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["jellyfin"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "jellyfin.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["kuma"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "kuma.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["minio"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "minio.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["minio-data"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "minio-data.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["npm"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "npm.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["portainer"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "portainer.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["radar"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "radar.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["readar"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "readar.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["sabnzbd"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sabnzbd.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["sonar"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sonar.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["tandoor"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tandoor.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["transmission"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "transmission.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["wyl"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "wyl.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @guilhermewolf, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*